In [17]:
import pandas as pd
import numpy as np

Importing data sets and combining them into one csv file

In [18]:
df1 = pd.read_csv("Crop_recommendation.csv")
df1.head()


df2 =pd.read_csv("CropNFert.csv")
df2.head()
df1.head()

,Nitrogen,phosphorus,potassium,temperature,humidity,ph,rainfall,label
0,90,42,43,20.879744,82.002744,6.502985,202.935536,rice
1,85,58,41,21.770462,80.319644,7.038096,226.655537,rice
2,60,55,44,23.004459,82.320763,7.840207,263.964248,rice
3,74,35,40,26.491096,80.158363,6.980401,242.864034,rice
4,78,42,42,20.130175,81.604873,7.628473,262.717340,rice

Removing unnecessary columns and rows in the first data set

In [19]:
#Selecting the columns we are going to keep
columns_to_keep_df1 =['Nitrogen','phosphorus','potassium','temperature','ph','rainfall','label']
df1 = df1[columns_to_keep_df1]
df1.head()

# isin() function to select rows we will keep

options1 = ['rice', 'mothbeans', 'mungbean']
new_df1 = df1[df1['label'].isin(options1)]
new_df1.head()

   Nitrogen  phosphorus  potassium  temperature        ph    rainfall label
0        90          42         43    20.879744  6.502985  202.935536  rice
1        85          58         41    21.770462  7.038096  226.655537  rice
2        60          55         44    23.004459  7.840207  263.964248  rice
3        74          35         40    26.491096  6.980401  242.864034  rice
4        78          42         42    20.130175  7.628473  262.717340  rice

We do the same for the second dataset

In [20]:
#Selecting the columns we are going to keep
columns_to_keep_df2 =['Nitrogen','Phosphorus','Potassium','Temperature','pH','Rainfall','Crop']
df2 = df2[columns_to_keep_df2]

# isin() function to select rows we will keep

options2 = ['Rice', 'Groundnut', 'Maize']
new_df2 = df2[df2['Crop'].isin(options2)]
new_df2.head()

     Nitrogen  Phosphorus  Potassium  Temperature   pH  Rainfall  Crop
624        20          15         20           25  5.5       700  Rice
625        25          15         20           25  5.5       700  Rice
626        30          15         20           25  5.5       700  Rice
627        20          20         25           30  6.0       800  Rice
628        25          20         25           30  6.0       800  Rice

Mapping the names of columns to rename the column names of the first dataset to the names of the second dataset to ensure no data is lost when concatenating

In [21]:
column_mapping = {
    'Nitrogen': 'Nitrogen',
    'phosphorus': 'Phosphorus',
    'potassium': 'Potassium',
    'temperature': 'Temperature',
    'ph': 'pH',
    'rainfall': 'Rainfall',
    'label' : 'Crop'

}

# Rename columns in new_df1 based on the mapping
new_df1 = new_df1.rename(columns=column_mapping)
new_df1.head()

   Nitrogen  Phosphorus  Potassium  Temperature        pH    Rainfall  Crop
0        90          42         43    20.879744  6.502985  202.935536  rice
1        85          58         41    21.770462  7.038096  226.655537  rice
2        60          55         44    23.004459  7.840207  263.964248  rice
3        74          35         40    26.491096  6.980401  242.864034  rice
4        78          42         42    20.130175  7.628473  262.717340  rice

checking the index(s) for each dataset

In [22]:
print(new_df1.index)
print(new_df2.index)

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       690, 691, 692, 693, 694, 695, 696, 697, 698, 699],
      dtype='int64', length=300)
Index([ 624,  625,  626,  627,  628,  629,  630,  631,  632,  633,
       ...
       4204, 4205, 4206, 4207, 4208, 4209, 4210, 4211, 4212, 4213],
      dtype='int64', length=836)

Resetting Index(s)

In [23]:
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
print(new_df1.index)
print(new_df2.index)

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       690, 691, 692, 693, 694, 695, 696, 697, 698, 699],
      dtype='int64', length=300)
Index([ 624,  625,  626,  627,  628,  629,  630,  631,  632,  633,
       ...
       4204, 4205, 4206, 4207, 4208, 4209, 4210, 4211, 4212, 4213],
      dtype='int64', length=836)

Then we concatinate the two new data frames into on data frame

In [27]:
concatenated_df = pd.concat([new_df1, new_df2], axis=0)
#concatenated_df.reset_index(drop=True, inplace=True)

#columns_to_drop = ['Nitrogen','Phosphorus','Potassium','Temperature','pH','Rainfall','Crop']
#concatenated_df = concatenated_df.drop(columns=columns_to_drop)
#duplicate_rows = concatenated_df[concatenated_df.duplicated()]

concatenated_df.drop_duplicates(keep='first', inplace=True)
#concatenated_df.drop_duplicates(keep='first', inplace=False)
concatenated_df.head()

   Nitrogen  Phosphorus  Potassium  Temperature        pH    Rainfall  Crop
0        90          42         43    20.879744  6.502985  202.935536  rice
1        85          58         41    21.770462  7.038096  226.655537  rice
2        60          55         44    23.004459  7.840207  263.964248  rice
3        74          35         40    26.491096  6.980401  242.864034  rice
4        78          42         42    20.130175  7.628473  262.717340  rice

Checking if any of the data is missing ie Null values

In [28]:
print(concatenated_df.isnull().sum())
concatenated_df.info()

Nitrogen       0
Phosphorus     0
Potassium      0
Temperature    0
pH             0
Rainfall       0
Crop           0
dtype: int64
<class 'pandas.core.frame.DataFrame'>
Index: 1119 entries, 0 to 4213
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Nitrogen     1119 non-null   int64
 1   Phosphorus   1119 non-null   int64
 2   Potassium    1119 non-null   int64
 3   Temperature  1119 non-null   float64
 4   pH           1119 non-null   float64
 5   Rainfall     1119 non-null   float64
 6   Crop         1119 non-null   object
dtypes: float64(3), int64(3), object(1)
memory usage: 69.9+ KB

splitting the data frame into the x terms and y terms

In [29]:
x=concatenated_df.drop('Crop', axis= 1)
y= concatenated_df['Crop']

Splitting the two new dataframes into training data and testing data while ensuring the new sub datasets represent their parent dataframes by stratify.

In [30]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train,y_test = train_test_split(x,y, stratify= y, random_state=1 )